{
  "nikNenkov": "Николай Ненков",
  "fullStackDeveloper": "Фул Стак Софтуерен Разработчик",
  "contactEmail": "Имейл",
  "contactPhone": "Телефон",
  "contactTitle": "Начини за връзка",
  "contactText": "Свържете се с мен, ако имате въпроси, искате да обсъдим проект или просто да се запознаем. Винаги съм отворен за нови възможности и предизвикателства.",

  "personalProfileTitle": "Личен профил",
  "personalProfileText": "Любител на природата, визуалните изкуства и средиземноморската кухня.\nКато опитен фул стак разработчик мога да поддържам и разширявам съществуващи ИТ системи, както и да проектирам и внедрявам нови. Мога да допринеса за вашата организация чрез намаляване на дългосрочните разходи, организиране на документация, интеграция на външен софтуер и обучение на млади програмисти. Основните ми цели са ясна комуникация, синхронизиране на хора с различни роли – на място и дистанционно, и работа в интерес на всички заинтересовани страни. Междудисциплинарните знания, натрупани през годините, ми позволяват да задавам по-добри въпроси, да виждам цялостната картина и да подобрявам детайлите, очаквани от дизайнери, мениджъри, DevOps, QA екипи и клиенти.",

  "downloadResume": "Изтегли Автобиография",
  "bookMeeting": "Запиши се за среща",
  "followOnLinkedin": "Последвай в LinkedIn",

  "workExperienceTitle": "Професионален опит",
  "workExperienceList": [
    {
      "title": "Софтуерен консултант | Различни клиенти",
      "period": "май 2023 – до момента",
      "desc": "Като софтуерен разработчик и независим консултант, разработвам и поддържам цялостни решения за международни клиенти в области като логистика, тикетинг, геолокация, разплащания и крипто гейминг. Създавам фронтенд приложения с React и Vue.js, както и бекенд услуги с Rust, Go, Java Spring и Node.js, използвайки OAuth за сигурност и бази данни като InfluxDB и PostgreSQL. Интегрирам множество външни API-та, включително Azure Cognitive Services и Stripe. Модернизирам наследени системи, подобрявам SDLC практики и управлявам проекти с фокус върху техническо съвършенство, ясна комуникация и синхрон с разпределени екипи. Освен това обучавам млади разработчици и осигурявам стабилност на системи с остарели технологии."
    },
    {
      "title": "Старши Фул Стак Разработчик | CODEXIO Ltd.",
      "period": "март 2021 – април 2023 | Хибридно",
      "desc": "В Codexio участвах в разработката на дигитални портфейли за международни компании, интегрирах Sportradar widgets и APIs, и създадох Angular компоненти за спортни данни на живо. Работих по проекти за електронни разплащания, трафик инженеринг и онлайн игри, като сътрудничих с глобални екипи за създаване на мащабируеми решения. Обучавах млади разработчици, гарантирах високо качество чрез тестове и ревюта, и внедрих нови функционалности като безплатни завъртания за повишаване на ангажираността. Разработих и инструменти за оптимизация на трафика и градския транспорт, ETL задачи, програмиране на контролери и симулации."
    },
    {
      "title": "Java Web Разработчик | Фрийланс",
      "period": "окт 2019 – март 2021 | Дистанционно",
      "desc": "Като Java разработчик на свободна практика създадох инструменти за проследяване на разходи и управление на доставчици за големи организации, включително бекенд с ElasticSearch, Spring Data REST и PostgreSQL. Работих директно с продуктови мениджъри и архитекти, участвах в срещи със заинтересовани страни и допринасях към системна документация. Разработвах сигурни REST API, интегрирах облачни услуги и автоматизирах бизнес процеси за клиенти в търговията и логистиката."
    },
    {
      "title": "Java Софтуерен Разработчик | EPAM Systems, Inc.",
      "period": "май 2018 – окт 2019 | На място",
      "desc": "В EPAM Systems разработвах и поддържах системи за контрол на достъпа и администраторски панели, осигурявайки сигурна комуникация с физически устройства чрез MQTT и богати JavaFX интерфейси. Участвах в изготвянето на Weekly Java Newsletter за 20 000+ служители и разработвах вътрешни инструменти за управление на хардуерни ресурси, RESTful API и OAuth2 интеграция. Работата ми беше насочена към сигурни и мащабируеми архитектури, автоматизирани тестове и тясно сътрудничество с дизайнери и мениджъри."
    },
    {
      "title": "Технологичен консултант | Фрийланс",
      "period": "2009 – 2017",
      "desc": "Като технологичен консултант съм доставял персонализиран софтуер, поддръжка на уебсайтове и обучение. Разработвал съм софтуер за сложни електротехнически изчисления, CMS за ресторант, MMORPG сървъри с SQL бази и сайтове за регистрация. Работил съм с 3D CAD моделиране в SolidWorks, преподавал съм ИТ, физика, математика, химия и програмиране, както и съм създавал сигурни C++ CLI чат приложения. Извършвал съм изчисления за фотоволтаични системи и съм участвал в въвеждане и контрол на данни за стартъпи."
    }
  ],

  "educationTitle": "Образование",
  "educationList": [
    {
      "title": "ПМГ „Акад. Иван Гюзелев“",
      "period": "2005 – 2010",
      "location": "Габрово, България",
      "major": "Математика и Информатика с Английски език",
      "url": "https://pmg-gabrovo.bg/",
      "desc": "Изучаване на математика и природни науки, с допълнителни умения по Visual Studio, HTML, CSS, PHP и C/C++. Участие в театрални постановки и екскурзии, развиващи креативността. Първата година беше фокусирана върху английски език, докато в последните две години се акцентира на математика и информатика. Придобити умения в програмирането, логическото мислене и решаването на проблеми."
    },
    {
      "title": "Технически Университет",
      "period": "2010 – 2013",
      "location": "Габрово, България",
      "major": "Електроенергетика и Електрообзавеждане",
      "url": "https://www.tugab.bg/",
      "desc": "Изучаване на електрически закони, диференциални уравнения, икономика на предприятието, техническо чертане, CAD моделиране и програмиране. Придобити практически умения с микрочипове, сградни инсталации и големи машини. Обучението не е завършено по лични причини, но придобитите знания са ценни за професионалното развитие."
    }
  ],

    "majorLabel": "Специалност",
  "skillsTitle": "Умения",
  "skillsList": [
    {
      "category": "Фул стак разработка",
      "items": "Java, SpringBoot, JSP, Quarkus, Angular, VueJS, React, TypeScript, Golang, Python, Node.js, PHP, JavaFX, C++, JavaScript, HTML, SASS, CSS, Bash"
    },
    {
      "category": "Софтуерно тестване",
      "items": "E2E, UI, API, unit, integration, mocking, автоматизирани тестове и build процеси, code review"
    },
    {
      "category": "Облак и DevOps",
      "items": "Docker, Kubernetes, Azure, CI/CD pipelines, VPS, AWS, XAMPP, cPanel, SSH, DNS, Content Distribution Networks"
    },
    {
      "category": "Системен дизайн и дебъгване",
      "items": "UML диаграми (Sequence, C4), анализ на логове, tracing, софтуерна архитектура, дизайн, анализ на изисквания, синхронизация със заинтересовани страни"
    },
    {
      "category": "API разработка и интеграция",
      "items": "REST, OAuth, MQTT, ETL, SQL, WS, библиотеки, услуги, OpenAPI Specification (OAS), външни интеграции, Stripe, Azure Cognitive Services, PDF Creator"
    },
    {
      "category": "Agile процеси",
      "items": "Jira, Figma, асинхронна работа с глобални екипи, Confluence, проектна подготовка, управление на репозитории, документация"
    },
    {
      "category": "Технически консултации и екипна подкрепа",
      "items": "Менторство, оптимизация на проекти, обучение, въвеждане, документация, събиране на изисквания, лидерство"
    },
    {
      "category": "Данни и визуализация",
      "items": "Data Mining, Data Visualization, PostgreSQL, ElasticSearch, ORM, Liquibase, репорти, OpenStreetMap, Thymeleaf"
    },
    {
      "category": "Друго",
      "items": "CAD (SolidWorks, AutoCAD), Строителни калкулации, Решаване на проблеми, Доставка до клиент, R&D, Печат, Sequence диаграми, JWT, Single Page Applications"
    }
  ],

  "referencesTitle": "Препоръки",
  "referencesText": "Предоставят се при поискване.",

  "footerThankYouTitle": "Благодаря",
  "footerThankYouText1": "Благодаря за отделеното време и внимание!",
  "footerThankYouText2": "Предлагам цялостна разработка на софтуер, системна интеграция, технически консултации и менторство.",
  "footerThankYouText3": "Ако търсите надежден партньор за модернизация на ИТ системи, оптимизация на процеси или реализиране на идеи, свържете се с мен.",
  "footerNavHome": "Начало",
  "footerNavAbout": "За Ник",
  "footerNavSkills": "Умения",
  "footerNavContact": "Контакт",
  "footerNavCourses": "Курсове",
  "footerNavDiagrams": "Скици",
  "footerNavProjects": "Проекти",
  "footerNavBooks": "Книги",
  "footerNavResume": "Резюме",
  "footerNavReferences": "Препоръки",
  "footerNavPersonalProfile": "Личен профил",
  "footerNavServices": "Услуги",
  "footerNavAchievements": "Постижения",
  "footerNavFuturePlans": "Бъдещи планове",
  "footerNavLooking": "Търся нови предизвикателства",
  "footerCopyright": "© 2025 Николай Ненков",

  "aboutTitle": "Повече за Ник",
  "aboutWelcome": "Здравей, казвам се Николай Ненков. Помагам на малки и средни бизнеси да използват силата на съвременните технологии, за да работят по-бързо, по-умно и с по-малко грешки. Зад гърба си имам над десетилетие в индустрията, включително корпоративни проекти, облачни системи и изграждане на мащабируеми приложения от нулата.",
  "aboutExperienceTitle": "Какво мога да направя за теб",
  "aboutExperienceText": "Разработвам специализирани уеб приложения, автоматизирам досадни процеси, помагам с цифрова трансформация и дигитален ред в бизнеса ти. Ако все още се пише ръчно, звъни се по телефона или се губи време в търсене на файлове – аз мога да направя нещата много по-лесни.",
  "aboutServicesTitle": "Как работя",
  "aboutServicesList": [
    "Слушам внимателно и предлагам ясни решения",
    "Обяснявам технически неща на разбираем език",
    "Работя на твоя страна – за резултат, не за шум"
  ],
  "aboutAchievementsTitle": "Какво ме отличава",
  "aboutAchievementsIntro": "Няколко причини клиентите да се връщат при мен:",
  "aboutAchievementsList": [
    "Говоря езика на бизнеса, не само на програмистите",
    "Работя бързо, но без компромиси с качеството",
    "Имам фирма, кола и опит – разбирам реалния свят"
  ],
  "aboutFuturePlansTitle": "Ако искаш...",
  "aboutFuturePlansText": "...да изчистим хаоса, да дигитализираме процеси или просто да обсъдим идея – пиши ми. Може да се окаже, че това, което изглежда скъпо и сложно, може да се реши за 2 седмици с разумен бюджет.",
  "aboutLookingTitle": "Свържи се с мен",
  "aboutLookingText": "Пиши ми, ако искаш да обсъдим нещо конкретно – първата среща е безплатна, а ползата от нея може да ти спести много главоболия.",
  
  "menuProjects": "История",
  "menuAbout": "За Ник",
  "menuSkills": "Умения",
  "menuContact": "Контакт",
  "menuHome": "Начало",
  "menuResume": "Резюме",
  "menuReferences": "Препоръки",
  "menuPersonalProfile": "Личен профил",
  "menuServices": "Услуги",
  "menuAchievements": "Постижения",
  "menuFuturePlans": "Бъдещи планове",
  "menuLooking": "Търся нови предизвикателства",
  "menuNikNenkov": "Николай Ненков",
  "menuCourses": "Уроци",
  "menuDiagrams": "Скици",
  "menuBooks": "Книги",
  "servicesTitle": "Услуги които предлагам",
  "servicesIntro": "Помагам на бизнеси като вашия да спестят време, да намалят грешките и да растат с помощта на правилните технологии. Ето как мога да ви бъда полезен:",
  "servicesList": [
    {
      "title": "Фул Стак Разработка",
      "desc": "Проектирам и изграждам стабилни уеб и мобилни приложения за вашия бизнес – от удобни интерфейси до сигурни бекенд системи. Модернизирам стари системи или създавам нови решения според вашите нужди."
    },
    {
      "title": "API разработка и интеграция",
      "desc": "Интегрирам разплащателни системи, инструменти за резервации и други услуги, за да направя бизнеса ви по-гъвкав и свързан."
    },
    {
      "title": "Автоматизация и оптимизация на процеси",
      "desc": "Автоматизирам повтарящи се задачи, оптимизирам работни потоци и повишавам ефективността на бизнес операциите ви."
    },
    {
      "title": "Персонализирани уебсайтове и онлайн магазини",
      "desc": "Красив и лесен за ползване сайт или онлайн магазин, който привлича повече клиенти и отличава бизнеса ви."
    },
    {
      "title": "Облак и DevOps решения",
      "desc": "Настройвам и автоматизирам облачна инфраструктура, архиви и внедрявания, така че бизнесът ви да работи гладко и сигурно, с по-малко ръчна работа."
    },
    {
      "title": "Системен дизайн и интеграция",
      "desc": "Свързвам вашите бизнес инструменти и системи, автоматизирам процеси и гарантирам, че всичко работи заедно ефективно."
    },
    {
      "title": "Софтуерно тестване и контрол на качеството",
      "desc": "Гарантирам, че софтуерът ви е надежден и без грешки чрез цялостно тестване и проверки на качеството, за да се фокусирате върху развитието на бизнеса си."
    },
    {
      "title": "Технически консултации и екипна подкрепа",
      "desc": "Давам ясни съвети, правя прегледи на проекти и обучавам екипи на разбираем език. Помагам ви да изберете правилната технология и подкрепям вашия персонал."
    },
    {
      "title": "Данни и отчети",
      "desc": "Превръщам данните на бизнеса ви в полезни отчети и табла, за да взимате по-добри решения и да следите важните неща."
    },
    {
      "title": "Обучение и преподаване",
      "desc": "Индивидуални уроци по математика, софтуер и науки за ученици, професионалисти и собственици на бизнес. Консултирам и мениджъри и компании за преодоляване на пропуски в знанията."
    }
  ],
  "servicesContactNote": "Готови ли сте бизнесът ви да стане по-лесен и успешен? <a href=\"mailto:nenkov.nik@gmail.com\">Свържете се с мен</a> за безплатна първа консултация."
}