{
  "nikNenkov": "Николай Ненков",
  "fullStackDeveloper": "Фул Стак Софтуерен Разработчик",
  "contactEmail": "Имейл",
  "contactPhone": "Телефон",

  "personalProfileTitle": "Личен профил",
  "personalProfileText": "Любител на природата, визуалните изкуства и средиземноморската кухня.\nКато опитен фул стак разработчик мога да поддържам и разширявам съществуващи ИТ системи, както и да проектирам и внедрявам нови. Мога да допринеса за вашата организация чрез намаляване на дългосрочните разходи, организиране на документация, интеграция на външен софтуер и обучение на млади програмисти. Основните ми цели са ясна комуникация, синхронизиране на хора с различни роли – на място и дистанционно, и работа в интерес на всички заинтересовани страни. Междудисциплинарните знания, натрупани през годините, ми позволяват да задавам по-добри въпроси, да виждам цялостната картина и да подобрявам детайлите, очаквани от дизайнери, мениджъри, DevOps, QA екипи и клиенти.",

  "workExperienceTitle": "Професионален опит",
  "workExperienceList": [
    {
      "title": "Софтуерен консултант | Различни клиенти",
      "period": "май 2023 – до момента",
      "desc1": "Като независим консултант съм реализирал цялостни решения за международни клиенти, включително разработка на крипто гейминг и маркетинг платформа, която позволява на потребителите да печелят токени чрез игри и гледане на реклами. Работих с разпределени екипи в България и Великобритания, интегрирах външни услуги като Azure Cognitive Services и Stripe, и обучавах млади разработчици. Модернизирах наследени системи, замених остарели бекенд решения с Node.js и подобрих SDLC практики за тикетинг и логистични платформи. Отговарях за проектна подготовка, управление на репозитории, документация, стратегии за внедряване и анализ на изисквания в асинхронна среда.",
      "desc2": "Поддържал и разширявал съм Java код, доставял съм бекенд услуги, REST API, фронтенд и автоматизирани бизнес скриптове, осигурявайки стабилност на системи с остарели технологии. Работата ми обхваща логистика, тикетинг, геолокация и разплащания, с фокус върху ясна комуникация, синхрон със заинтересованите страни и техническо съвършенство."
    },
    {
      "title": "Старши Фул Стак Разработчик | CODEXIO Ltd.",
      "period": "март 2021 – април 2023 | Хибридно",
      "desc1": "В Codexio участвах в разработката на дигитални портфейли за международни компании, интегрирах Sportradar widgets и APIs, и създадох Angular компоненти за спортни данни на живо. Работих по проекти за електронни разплащания, трафик инженеринг и онлайн игри, като сътрудничих с глобални екипи за създаване на мащабируеми решения. Обучавах млади разработчици, гарантирах високо качество чрез тестове и ревюта, и внедрих нови функционалности като безплатни завъртания за повишаване на ангажираността. Разработих и инструменти за оптимизация на трафика и градския транспорт, ETL задачи, програмиране на контролери и симулации.",
      "desc2": ""
    },
    {
      "title": "Java Web Разработчик | Фрийланс",
      "period": "окт 2019 – март 2021 | Дистанционно",
      "desc1": "Като Java разработчик на свободна практика създадох инструменти за проследяване на разходи и управление на доставчици за големи организации, включително бекенд с ElasticSearch, Spring Data REST и PostgreSQL. Работих директно с продуктови мениджъри и архитекти, участвах в срещи със заинтересовани страни и допринасях към системна документация. Разработвах сигурни REST API, интегрирах облачни услуги и автоматизирах бизнес процеси за клиенти в търговията и логистиката.",
      "desc2": ""
    },
    {
      "title": "Java Софтуерен Разработчик | EPAM Systems, Inc.",
      "period": "май 2018 – окт 2019 | На място",
      "desc1": "В EPAM Systems разработвах и поддържах системи за контрол на достъпа и администраторски панели, осигурявайки сигурна комуникация с физически устройства чрез MQTT и богати JavaFX интерфейси. Участвах в изготвянето на Weekly Java Newsletter за 20 000+ служители и разработвах вътрешни инструменти за управление на хардуерни ресурси, RESTful API и OAuth2 интеграция. Работата ми беше насочена към сигурни и мащабируеми архитектури, автоматизирани тестове и тясно сътрудничество с дизайнери и мениджъри.",
      "desc2": ""
    },
    {
      "title": "Технологичен консултант | Фрийланс",
      "period": "2009 – 2017",
      "desc1": "Като технологичен консултант съм доставял персонализиран софтуер, поддръжка на уебсайтове и обучение. Разработвал съм софтуер за сложни електротехнически изчисления, CMS за ресторант, MMORPG сървъри с SQL бази и сайтове за регистрация. Работил съм с 3D CAD моделиране в SolidWorks, преподавал съм ИТ, физика, математика, химия и програмиране, както и съм създавал сигурни C++ CLI чат приложения. Извършвал съм изчисления за фотоволтаични системи и съм участвал в въвеждане и контрол на данни за стартъпи.",
      "desc2": ""
    }
  ],

  "educationTitle": "Образование",
  "educationList": [
    {
      "title": "Природо-математическа гимназия | Габрово, България",
      "period": "2005 – 2010",
      "desc": "Профил: математика, информатика и английски език. Обучението беше насочено към математика, с допълнителни умения по Visual Studio, HTML, CSS, PHP и C/C++. Участие в театрални постановки и екскурзии, развиващи креативността. Първата година беше фокусирана върху английски език."
    },
    {
      "title": "Технически университет | Габрово, България",
      "period": "2010 – 2013",
      "desc": "Специалност: Електротехника и технологии. Обучението обхващаше основни електрически закони, сложни схеми, CAD моделиране и програмиране. Придобити практически умения с микрочипове и големи машини. Обучението не е завършено по лични причини, но придобитите знания са ценни за професионалното развитие."
    }
  ],

  "skillsTitle": "Умения",
  "skillsList": [
    {
      "category": "Фул стак разработка",
      "items": "Java, SpringBoot, JSP, Quarkus, Angular, VueJS, React, TypeScript, Golang, Python, Node.js, PHP, JavaFX, C++, JavaScript, HTML, SASS, CSS, Bash"
    },
    {
      "category": "Софтуерно тестване",
      "items": "E2E, UI, API, unit, integration, mocking, автоматизирани тестове и build процеси, code review"
    },
    {
      "category": "Облак и DevOps",
      "items": "Docker, Kubernetes, Azure, CI/CD pipelines, VPS, AWS, XAMPP, cPanel, SSH, DNS, Content Distribution Networks"
    },
    {
      "category": "Системен дизайн и дебъгване",
      "items": "UML диаграми (Sequence, C4), анализ на логове, tracing, софтуерна архитектура, дизайн, анализ на изисквания, синхронизация със заинтересовани страни"
    },
    {
      "category": "API разработка и интеграция",
      "items": "REST, OAuth, MQTT, ETL, SQL, WS, библиотеки, услуги, OpenAPI Specification (OAS), външни интеграции, Stripe, Azure Cognitive Services, PDF Creator"
    },
    {
      "category": "Agile процеси",
      "items": "Jira, Figma, асинхронна работа с глобални екипи, Confluence, проектна подготовка, управление на репозитории, документация"
    },
    {
      "category": "Технически консултации и екипна подкрепа",
      "items": "Менторство, оптимизация на проекти, обучение, въвеждане, документация, събиране на изисквания, лидерство"
    },
    {
      "category": "Данни и визуализация",
      "items": "Data Mining, Data Visualization, PostgreSQL, ElasticSearch, ORM, Liquibase, репорти, OpenStreetMap, Thymeleaf"
    },
    {
      "category": "Друго",
      "items": "CAD (SolidWorks, AutoCAD), Строителни калкулации, Решаване на проблеми, Доставка до клиент, R&D, Печат, Sequence диаграми, JWT, Single Page Applications"
    }
  ],

  "referencesTitle": "Препоръки",
  "referencesText": "Предоставят се при поискване.",

  "footerThankYouTitle": "Благодаря",
  "footerThankYouText1": "Благодаря за отделеното време и внимание!",
  "footerThankYouText2": "Предлагам цялостна разработка на софтуер, системна интеграция, технически консултации и менторство.",
  "footerThankYouText3": "Ако търсите надежден партньор за модернизация на ИТ системи, оптимизация на процеси или реализиране на идеи, свържете се с мен.",
  "footerNavHome": "Начало",
  "footerNavAbout": "За Ник",
  "footerNavSkills": "Умения",
  "footerNavContact": "Контакт",
  "footerNavCourses": "Курсове",
  "footerNavDiagrams": "Диаграми",
  "footerNavProjects": "Проекти",
  "footerNavBooks": "Книги",
  "footerCopyright": "© 2025 Николай Ненков",

  "aboutTitle": "За Ник",
  "aboutWelcome": "Добре дошли в моя професионален сайт! Казвам се Николай Ненков и съм страстен фул стак разработчик с богат опит в създаването на стабилни, мащабируеми и иновативни решения. Този сайт представя моя професионален път, постиженията ми и услугите, които предлагам.",
  "aboutExperienceTitle": "Професионален опит",
  "aboutExperienceText": "През годините съм работил по различни проекти – от корпоративни приложения до иновативни облачни решения. Имам експертиза във фронтенд и бекенд разработката, облачни и DevOps технологии, системен дизайн и технически консултации.",
  "aboutServicesTitle": "Услуги, които предлагам",
  "aboutServicesList": [
    "Фул стак разработка на уеб и мобилни приложения",
    "Облачни и DevOps решения, включително CI/CD процеси",
    "Консултации по системен дизайн и архитектура",
    "Разработка и интеграция на API",
    "Техническо менторство и екипна подкрепа"
  ],
  "aboutAchievementsTitle": "Постижения",
  "aboutAchievementsIntro": "В професионалната си кариера съм постигнал редица успехи, сред които:",
  "aboutAchievementsList": [
    "Успешно ръководене на екипи по сложни проекти",
    "Доставка на висококачествени софтуерни решения в кратки срокове",
    "Принос към open-source проекти и технически общности",
    "Признание за иновативно решаване на проблеми и лидерство"
  ],
  "aboutFuturePlansTitle": "Бъдещи планове",
  "aboutFuturePlansText": "Постоянно търся нови предизвикателства и възможности за развитие. В бъдеще планирам да изследвам нови технологии, да разширя познанията си в областта на изкуствения интелект и машинното обучение и да работя с глобални екипи по значими проекти.",
  "aboutLookingTitle": "Търся нови предизвикателства",
  "aboutLookingText": "Винаги съм отворен за интересни възможности и сътрудничество. Ако имате проект или идея, която съвпада с моите умения и интереси, не се колебайте да се свържете с мен!",

  "menuProjects": "Проекти",
  "menuCourses": "Уроци",
  "menuDiagrams": "Диаграми",
  "menuBooks": "Книги"
}