{
  "nikNenkov": "Nik Nenkov",
  "fullStackDeveloper": "Full Stack Software Developer",
  "contactEmail": "Email",
  "contactPhone": "Phone",
  "contactTitle": "Ways to Get in Touch",
  "contactText": "Contact me if you have questions, want to discuss a project, or just want to connect. I am always open to new opportunities and challenges.",

  "personalProfileTitle": "Personal Profile",
  "personalProfileText": "Nature lover, visual arts enthusiast, Mediterranean food fan.\nAs an experienced full-stack developer, capable of supporting and extending your existing IT systems, and designing and implementing new ones, I can contribute to your organization by reducing long-term costs, organizing your documentation, integrating third-party software, and leading junior developers. My goals are centred around clear communication, synchronising people with different roles onsite and remotely, and working in stakeholders' best interests. Interdisciplinary knowledge gained throughout the years is allowing me to ask better questions, look at the greater scale of things as well as improving and fixing the details expected by the designers, managers, DevOps and QA teams, and customers.",

  "workExperienceTitle": "Work Experience",
  "workExperienceList": [
    {
      "title": "Software Development Contractor | Various Clients",
      "period": "May 2023 - Present",
      "desc": "As a software developer and independent consultant, I design and maintain end-to-end solutions for international clients in areas such as logistics, ticketing, geolocation, payments, and crypto gaming. I build frontend applications with React and Vue.js, as well as backend services using Rust, Go, Java Spring, and Node.js, leveraging OAuth for security and databases like InfluxDB and PostgreSQL. I integrate various external APIs, including Azure Cognitive Services and Stripe. I modernize legacy systems, improve SDLC practices, and manage projects with a focus on technical excellence, clear communication, and alignment with distributed teams. Additionally, I mentor junior developers and ensure stability for systems running on outdated technologies."    },
    {
      "title": "Senior Full Stack Developer | CODEXIO Ltd.",
      "period": "Mar 2021 - Apr 2023 | Hybrid",
      "desc": "At Codexio, I contributed to high-traffic digital wallet applications for multinational online payments providers, integrating Sportradar widgets and APIs, and developing reusable Angular component libraries for live sports data. I worked on projects in electronic payments, traffic engineering, and online gaming, collaborating with global teams to deliver robust, scalable solutions. My role included mentoring junior developers, ensuring high code quality through thorough testing and code reviews, and implementing new features such as free spins to increase user engagement. I also developed tools for traffic engineering and public transport optimization, building ETL jobs, programming traffic controllers, and running large-scale simulations."
    },
    {
      "title": "Java Web Developer | Freelance",
      "period": "Oct 2019 - Mar 2021 | Remote",
      "desc": "As a freelance Java developer, I built tools for tracking business spendings and managing vendor performance for large organizations, including backend development using ElasticSearch, Spring Data REST, and PostgreSQL. I collaborated directly with product owners and architects, participated in stakeholder meetings, and contributed to system diagrams and documentation. My work included developing secure REST APIs, integrating with cloud environments, and automating business workflows for clients in retail and logistics."
    },
    {
      "title": "Java Software Developer | EPAM Systems, Inc.",
      "period": "May 2018 - Oct 2019 | On-site",
      "desc": "At EPAM Systems, I developed and maintained access control management systems and admin panels, enabling secure communication with physical devices via MQTT and providing rich JavaFX-based interfaces. I contributed to the Weekly Java Newsletter, curated for 20,000+ employees, and developed internal tools for hardware resource tracking, RESTful APIs, and OAuth2 integration. My work emphasized secure, scalable architectures, automated build and testing workflows, and close collaboration with UI/UX designers and delivery managers."
    },
    {
      "title": "Technology Consultant | Freelance",
      "period": "2009 - 2017",
      "desc": "As a technology consultant, I delivered custom software solutions, website maintenance, and tutoring services. I engineered software for complex electrical engineering equations, built a CodeIgniter-based CMS for a local restaurant, and deployed MMORPG servers with SQL databases and user registration websites. My work included 3D CAD modeling in SolidWorks for furniture and machinery, tutoring in IT, physics, math, chemistry, and programming, and developing secure C++ CLI chat applications. I also conducted photovoltaic system calculations for solar energy solutions and contributed to data entry and QA for startups, ensuring data accuracy and process quality."
    }
  ],

  "educationTitle": "Education",
  "educationList": [
    {
      "title": "High School of Mathematics and Natural Sciences",
      "period": "2005 – 2010",
      "location": "Gabrovo, Bulgaria",
      "major": "Mathematics and Informatics with English Language",
      "url": "https://pmg-gabrovo.bg/",
      "desc": "Studied mathematics and natural sciences, with additional skills in Visual Studio, HTML, CSS, PHP, and C/C++. Participated in drama performances and excursions that fostered creativity. The first year focused on English language, while the last two years emphasized mathematics and informatics. Acquired skills in programming, logical thinking, and problem-solving."
    },
    {
      "title": "Technical University",
      "period": "2010 – 2013",
      "location": "Gabrovo, Bulgaria",
      "major": "Electrical Power Engineering and Electrical Equipment",
      "url": "https://www.tugab.bg/",
      "desc": "Studied electrical laws, differential equations, enterprise economics, technical drawing, CAD modeling, and programming. Gained practical experience with microchips, building installations, and large machines. The education was not completed due to personal reasons, but the acquired knowledge has been valuable for professional development."
    }
    ],
    "majorLabel": "Major",
  "skillsTitle": "Skills",
  "skillsList": [
    {
      "category": "Full-stack development",
      "items": "Java, SpringBoot, JSP, Quarkus, Angular, VueJS, React, TypeScript, Golang, Python, Node.js, PHP, JavaFX, C++, JavaScript, HTML, SASS, CSS, Bash"
    },
    {
      "category": "Software testing",
      "items": "E2E, UI, API, unit, integration, mocking, automated build and testing workflows, code reviews"
    },
    {
      "category": "Cloud and DevOps",
      "items": "Docker, Kubernetes, Azure, CI/CD pipelines, VPS, AWS, XAMPP, cPanel, SSH, DNS, Content Distribution Networks"
    },
    {
      "category": "System design and debugging",
      "items": "Sequence and C4 model UML diagrams, log analysis, system tracing, software architecture, software design, requirements analysis, stakeholder alignment"
    },
    {
      "category": "API development and integration",
      "items": "REST, OAuth, MQTT, ETL, SQL, WS, libraries, services, OpenAPI Specification (OAS), 3rd Party Integrations, Stripe, Azure Cognitive Services, PDF Creator"
    },
    {
      "category": "Agile workflows",
      "items": "Jira, Figma, async collaboration with global teams, Confluence, project setup, repository management, design documentation"
    },
    {
      "category": "Technical consulting and team support",
      "items": "Mentoring, project optimization, tutoring, onboarding, documentation, requirements gathering, team leadership"
    },
    {
      "category": "Data and Visualization",
      "items": "Data Mining, Data Visualization, PostgreSQL, ElasticSearch, ORM, Liquibase, reporting, OpenStreetMap, Thymeleaf"
    },
    {
      "category": "Other",
      "items": "CAD (SolidWorks, AutoCAD), Construction Estimating, Problem Solving, Client Delivery, Research and Development (R&D), Printing, Sequence Diagrams, JWT, Single Page Applications"
    }
  ],

  "referencesTitle": "References",
  "referencesText": "Available upon request.",

  "footerThankYouTitle": "Thank You",
  "footerThankYouText1": "Thank you for your time and attention!",
  "footerThankYouText2": "I offer end-to-end software development, system integration, technical consulting, and mentoring services.",
  "footerThankYouText3": "If you are looking for a reliable partner to modernize your IT systems, optimize workflows, or bring your ideas to life, feel free to connect with me.",
  "footerNavHome": "Home",
  "footerNavAbout": "About",
  "footerNavSkills": "Skills",
  "footerNavContact": "Contact",
  "footerNavCourses": "Courses",
  "footerNavDiagrams": "Diagrams",
  "footerNavProjects": "Projects",
  "footerNavBooks": "Books",
  "footerNavServices": "Services",
  "footerNavAchievements": "Achievements",
  "footerNavFuturePlans": "Future Plans",
  "footerNavLooking": "Looking for New Challenges",
  "footerCopyright": "© 2025 Nikolay Nenkov",

  "aboutTitle": "About Nik",
  "aboutWelcome": "Hello, my name is Nikolay Nenkov. I help small and medium businesses harness the power of modern technology to work faster, smarter, and with fewer errors. I have over a decade of industry experience, including corporate projects, cloud systems, and building scalable applications from scratch.",
  "aboutExperienceTitle": "What I Can Do For You",
  "aboutExperienceText": "I develop custom web applications, automate tedious processes, and help with digital transformation and organization in your business. If things are still done by hand, calls are made by phone, or time is wasted searching for files – I can make everything much easier.",
  "aboutServicesTitle": "How I Work",
  "aboutServicesList": [
    "I listen carefully and offer clear solutions",
    "I explain technical matters in plain language",
    "I work on your side – for results, not just noise"
  ],
  "aboutAchievementsTitle": "What Sets Me Apart",
  "aboutAchievementsIntro": "A few reasons why clients come back to me:",
  "aboutAchievementsList": [
    "I speak the language of business, not just developers",
    "I work fast, but never compromise on quality",
    "I have a company, a car, and real-world experience"
  ],
  "aboutFuturePlansTitle": "If You Want...",
  "aboutFuturePlansText": "...to clear the chaos, digitize processes, or just discuss an idea – write to me. Sometimes what seems expensive and complicated can be solved in 2 weeks with a reasonable budget.",
  "aboutLookingTitle": "Contact Me",
  "aboutLookingText": "Write to me if you want to discuss something specific – the first meeting is free, and the benefit from it could save you a lot of headaches.",

  "menuProjects": "History",
  "menuAbout": "About",
  "menuSkills": "Skills",
  "menuContact": "Contact",
  "menuHome": "Home",
  "menuResume": "Resume",
  "menuReferences": "References",
  "menuPersonalProfile": "Personal Profile",
  "menuServices": "Services",
  "menuAchievements": "Achievements",
  "menuFuturePlans": "Future Plans",
  "menuLooking": "Looking for New Challenges",
  "menuNikNenkov": "Nik Nenkov",
  "menuCourses": "Courses",
  "menuDiagrams": "Diagrams",
  "menuBooks": "Books",

  "servicesTitle": "Services I Offer",
  "servicesIntro": "I help businesses like yours save time, reduce mistakes, and grow with the right technology. Here’s how I can help you:",
  "servicesList": [
    {
      "title": "Full-Stack Development",
      "desc": "Design and build robust web and mobile applications for your business, from user-friendly interfaces to secure backends. Modernize old systems or create new solutions tailored to your needs."
    },
    {
      "title": "API Development & Integration",
      "desc": "Integrate payment systems, booking tools, and other services to make your business more flexible and connected."
    },
    {
      "title": "Automation & Process Optimization",
      "desc": "Automate repetitive tasks, streamline workflows, and improve efficiency in your business operations."
    },
    {
      "title": "Custom Websites & Online Stores",
      "desc": "Get a beautiful, easy-to-use website or online shop that brings you more customers and makes your business stand out."
    },
    {
      "title": "Cloud & DevOps Solutions",
      "desc": "Set up and automate cloud infrastructure, backups, and deployments so your business runs smoothly and securely, with less manual work."
    },
    {
      "title": "System Design & Integration",
      "desc": "Connect your business tools and systems, automate workflows, and ensure everything works together efficiently."
    },
    {
      "title": "Software Testing & Quality Assurance",
      "desc": "Ensure your software is reliable and bug-free with thorough testing and quality checks, so you can focus on growing your business."
    },
    {
      "title": "Technical Consulting & Team Support",
      "desc": "Get clear advice, project reviews, and team training in plain language. I help you choose the right technology and support your staff."
    },
    {
      "title": "Data & Reporting",
      "desc": "Turn your business data into useful reports and dashboards, so you can make better decisions and track what matters."
    },
    {
      "title": "Tutoring & Teaching",
      "desc": "Personalized lessons in math, software, and science for students, professionals, and business owners. I also consult managers and companies to bridge knowledge gaps."
    }
  ],
  "servicesContactNote": "Ready to make your business easier and more successful? <a href=\"mailto:nenkov.nik@gmail.com\">Use email</a> for a free first consultation."
}